#!/usr/bin/env python3
# Кортежи/множества
'''
Задание 6
Напишите программу, которая выводит все четные числа из кортежа в исходном
порядке, и останавливается когда число равно 815.
'''
numbers = (386, 462, 47, 418, 907, 344, 236, 375, 823, 566, 597, 978, 328, 615, 953, 345, 399, 162, 758, 219, 918, 237, 412, 566, 826, 248, 866, 950, 626, 949, 687, 217, 815, 67, 104, 58, 512, 24, 892, 894, 767, 553, 81, 379, 843, 831, 445, 742, 717, 958,743, 527)

evennums = []
for i in range(len(numbers)):
    if numbers[i] == 815:
        break
    elif numbers[i] % 2 == 0:
        evennums.append(numbers[i])
evennums = tuple(evennums)
print(evennums)
