#!/usr/bin/env python3
'''
Задание 4
Обработать переменные и получить результат:
    nohtyp evol I
    my friend
    плмрим
'''

string1 = 'I love python'
string2 = 'Hello my dear friend'
string3 = 'полиморфизм'

print(string1[::-1])
print(string2[6:9:] + string2[14::])
print(string3[::2])
