#!/usr/bin/env python3
'''
Задание 13
Шоколадка имеет вид прямоугольника, разделенного на width×length долек.
Шоколадку можно один раз разломить по прямой на две части.
Определите, можно ли таким образом отломить от шоколадки часть, состоящую
ровно из x долек. Программа получает на вход три числа: width, length, parts
и должна вывести YES или NO. (учтите что пользователь может ввести не
правильные параметры, ваша программа не должна вылетать с ошибкой)

                     length
+-----+-----+-----+-----+-----+-----+-----+-----+
|     |     |     |     |     |     |     |     |
|     |     |     |     |     |     |     |     |
+-----+-----+-----+-----+-----+-----+-----+-----+
|     |     |     |     |     |     |     |     | w
|     |     |     |     |     |     |     |     | i
+-----+-----+-----+-----+-----+-----+-----+-----+ d
|     |     |     |     |     |     |     |     | t
|     |     |     |     |     |     |     |     | h
+-----+-----+-----+-----+-----+-----+-----+-----+
|     |     |     |     |     |     |     |     |
|     |     |     |     |     |     |     |     |
+-----+-----+-----+-----+-----+-----+-----+-----+
'''
width = input("Введите width: ")
length = input("Введите length: ")
parts = input("Введите parts: ")

if not width.isdigit() or not length.isdigit() or not parts.isdigit():
    print("Error. Input values are not digits!")
    exit()

if (int(parts) % int(width)) == 0 or (int(parts) % int(length)) == 0:
    print("YES")
else:
    print("NO")
