#!/usr/bin/env python3
'''
Задание 1
спросить имя пользователя и поприветствовать его.
'''

name = input("Введите имя: ")
print("Привет, " + name)
