#!/usr/bin/env python3
'''
Задание 2
сосчитать три числа и вывeсти их сумму.
'''

num1 = int(input("Введите первое число: "))
num2 = int(input("Введите второе число: "))
num3 = int(input("Введите третье число: "))

print(f"Сумма чисел {num1}, {num2} и {num3} равно {num1 + num2 + num3}")
