#!/usr/bin/env python3
'''
Задание 4
спросить число у пользователя и вернуть число до него и после
'''

number = int(input("Введите число: "))

print(f"Следующее число для {number} --> {number + 1}")
print(f"Предыдущее число для {number} --> {number - 1}")
