#!/usr/bin/env python3
'''
Задание 7
создать переменные "spam" и "eggs" и объединить их
'''

s = "spam"
e = "eggs"

# Без пробела
print(s + e)

# С пробелом
print(s, e)
