[
    {
        "title": "Узбекско-российский бизнес-форум прошёл в Самарканде",
        "description": "На узбекско-российском бизнес-форуме, где выступили вице-премьер — глава МИВТ Жамшид Ходжаев и министр экономического развития РФ Максим Решетников, отмечалось, что за последние пять лет товарооборот между странами вырос на 170%, а по итогам 2021 года — ещё на треть.",
        "publication": "Сегодня, 18:45",
        "image_link": "https://www.gazeta.uz/media/img/2022/12/w90Ds616699021816221_m.jpg"
    },
    {
        "title": "Президент Узбекистана одобрил меры по упрощению продажи земель с аукциона",
        "description": "Для упрощения продажи земельных участков с аукциона предлагается сократить этапы и сроки выставления земель на торги, привлечь сотрудников кадастровых органов к этому процессу и снизить размер пошлины за приватизацию. Президент Узбекистана одобрил эти меры.",
        "publication": "Сегодня, 09:48",
        "image_link": "https://www.gazeta.uz/media/img/2022/12/RFlTmC16698693617644_m.jpg"
    },
    {
        "title": "Генпрокуратура проверяет обвинения индийского инвестора в адрес хокима Ташкента",
        "description": "Генпрокуратура Узбекистана приступила к проверке заявления индийского бизнесмена Мурари Лал Джалана, который ранее обвинил хокима Ташкента Джахонгира Артыкходжаева в шантаже.",
        "publication": "Вчера, 18:33 ",
        "image_link": "https://www.gazeta.uz/media/img/2022/11/6Kk1F316697951966848_m.jpg"
    },
    {
        "title": "Турецкий Akça Holding хочет организовать производство текстиля в Узбекистане на $250 млн",
        "description": "Турецкий холдинг Akça Holding планирует создать текстильное производство в Наманганской области стоимостью 250 млн долларов. Предприятие будет экспортировать продукцию в США, Европу и другие страны.",
        "publication": "Вчера, 17:18",
        "image_link": "https://www.gazeta.uz/media/img/2022/11/fq8gYJ16698084150314_m.jpg"
    },
    {
        "title": "Как Центробанк Узбекистана намерен снижать уровень долларизации в банках",
        "description": "Высокий уровень долларизации экономики снижает эффективность денежно-кредитной политики в достижении цели по стабилизации цен, отметили в Центробанке. Для борьбы с этим регулятор намерен добиться снижения уровня инфляции, что, как ожидается, поможет снизить ставки по кредитам и уровень долларизации.",
        "publication": "Вчера, 15:26",
        "image_link": "https://www.gazeta.uz/media/img/2021/01/3eHlrc16112441736395_m.jpg"
    },
    {
        "title": "Трёхдневная фирма выиграла конкурс на установку теплиц на 2,6 млрд сумов",
        "description": "В Кашкадарье компания NXS Ctroy Bad Metall, зарегистрированная за три дня до завершения торгов, выиграла тендер на установку теплиц стоимостью 2,6 млрд сумов. Антимонопольный комитет выявил нарушения и добился отмены решений закупочной комиссии.",
        "publication": "29 ноября 2022, 17:28 ",
        "image_link": "https://www.gazeta.uz/media/img/2019/05/0OD77E15580779556908_m.jpg"
    },
    {
        "title": "Узбекистан и Украина обсудили взаимные льготы для бизнеса",
        "description": "Замминистра иностранных дел Узбекистана Бахром Аълоев и посол Украины Николай Дорошенко на встрече в МИДе обсудили предоставление взаимных льгот и преференций деловым кругам двух стран.",
        "publication": "29 ноября 2022, 16:36 ",
        "image_link": "https://www.gazeta.uz/media/img/2022/11/xye7k716697216139465_m.jpg"
    },
    {
        "title": "Bank Apelsin стал Uzum Bank",
        "description": "Цифровой Bank Apelsin, основанный год назад, сменил название на Uzum Bank.",
        "publication": "29 ноября 2022, 14:05 ",
        "image_link": "https://www.gazeta.uz/media/img/2022/11/XkBMka16697126318391_m.jpg"
    },
    {
        "title": "Речь шла о «тройственном газовом союзе» — пресс-секретарь Токаева",
        "description": "Пресс-секретарь президента Казахстана уточнил, что Касым-Жомарт Токаев и Владимир Путин обсуждали создание «тройственного газового союза» (Россия + Казахстан + Узбекистан).",
        "publication": "29 ноября 2022, 11:08 ",
        "image_link": "https://www.gazeta.uz/media/img/2022/11/2fvcY016697020156054_m.jpg"
    },
    {
        "title": "Из Ташкента в Нукус — за 7 часов, в Ургенч — за 6?",
        "description": "Президент поручил запустить проект электрификации железной дороги до Нукуса. Время в пути из Ташкента должно сократиться до 7 часов. До Ургенча скоростной электропоезд, как заявляется, будет доезжать за 6 часов (ранее сообщалось о 8 часах).",
        "publication": "28 ноября 2022, 21:13 ",
        "image_link": "https://www.gazeta.uz/media/img/2022/11/zz3sEw16696519247070_m.jpg"
    },
    {
        "title": "Отказ от льгот, снятие барьеров при импорте: условия ЦБ для эффективной монетарной политики",
        "description": "Центробанк Узбекистана для повышения эффективности монетарной политики призывает правительство снять барьеры при импорте, привлечь частный бизнес в железнодорожный и авиатранспорт, перевести оптовую торговлю в безналичную форму, отказаться от льготных и директивных кредитов и принять другие меры.",
        "publication": "28 ноября 2022, 20:27 ",
        "image_link": "https://www.gazeta.uz/media/img/2018/07/4xDQIp15326054319527_m.jpg"
    },
    {
        "title": "Как будет развиваться экономика Узбекистана в 2023—2025 годах — два сценария от ЦБ",
        "description": "Центробанк утвердил два сценария развития экономики Узбекистана в 2023—2025 годах. При их разработке учитывались сохранение высокой неопределённости в мире, снижение цен на основные сырьевые товары, ограничение возможностей финансирования из бюджета, необходимость проведения реформ и другое.",
        "publication": "28 ноября 2022, 16:06 ",
        "image_link": "https://www.gazeta.uz/media/img/2022/10/N70vOi16660986746384_m.jpg"
    },
    {
        "title": "Грузовой терминал аэропорта и СЭЗ Навои переданы в управление компаниям ОАЭ",
        "description": "Эмиратские компании взяли в управление свободную экономическую зону «Навои» и грузовой терминал навоийского аэропорта. Президент принял участие в церемонии подписания документов.",
        "publication": "25 ноября 2022, 23:16 ",
        "image_link": "https://www.gazeta.uz/media/img/2022/11/rEAhRl16694000708608_m.jpg"
    },
    {
        "title": "Единый онкологический комплекс строит Mimar Group на основе закрытого постановления",
        "description": "Строительством единого онкологического комплекса стоимостью 600 млрд сумов, который объединит Республиканский онкоцентр, его Ташкентский и областной филиалы, занимается Mimar Group. Первый замглавы Минздрава сообщил, что это предусмотрено закрытым постановлением Кабмина.",
        "publication": "25 ноября 2022, 20:49 ",
        "image_link": "https://www.gazeta.uz/media/img/2022/11/6247mq16693885841830_m.jpg"
    },
    {
        "title": "Льготы для электромобильной отрасли обсуждались у президента",
        "description": "Электромобили, выпускаемые в Узбекистане, планируется освободить от утильсбора, комплектующие, запчасти, оборудование и сырьё — от таможенной пошлины. Инвесторам могут разрешить ввозить определённое количество электромобилей на льготных условиях, отмечалось на совещании у президента.",
        "publication": "24 ноября 2022, 23:27 ",
        "image_link": "https://www.gazeta.uz/media/img/2019/12/oEMzbZ15760664350258_m.jpg"
    },
    {
        "title": "Узбекистан и Франция договорились расширить добычу и переработку урана",
        "description": "Госкомгеологии, «Навоийуран» и французская Orano подписали трёхстороннее соглашение о расширении добычи и переработки урана. Узбекистан намерен ориентироваться на французскую модель в «цепочке создания стоимости ядерного топлива». Orano готовится инвестировать «несколько сотен миллионов евро».",
        "publication": "24 ноября 2022, 19:48 ",
        "image_link": "https://www.gazeta.uz/media/img/2022/11/9eOY5X16693007201901_m.jpg"
    },
    {
        "title": "Первая в Узбекистане автоматизированная парковка начала работу в аэропорту Ташкента",
        "description": "Первая в Узбекистане полностью автоматизированная парковка заработала перед терминалом вылета международного аэропорта Ташкента. Она рассчитана на 333 паркоместа. Оплатить парковку можно через паркомат наличными или по QR-коду. Паркомат принимает старые и новые купюры и умеет давать сдачу.",
        "publication": "24 ноября 2022, 16:49 ",
        "image_link": "https://www.gazeta.uz/media/img/2022/11/u2gl6M16692904786325_m.jpg"
    },
    {
        "title": "Разработка «Онлайн-махалли» без тендера обошлась в 8,4 млрд сумов",
        "description": "Агентство по работе махаллабай при Минэкономразвития и сокращения бедности потратило 8,4 млрд сумов ($755 тысяч) на разработку платформы «Онлайн-махалля» без проведения тендера. Она создана для работы помощников хокимов и подачи заявлений на получений субсидий, трудоустройство и другие цели.",
        "publication": "24 ноября 2022, 15:30 ",
        "image_link": "https://www.gazeta.uz/media/img/2022/11/SsGMrQ16692838408566_m.jpg"
    },
    {
        "title": "«Узбеккосмос» будет выявлять нарушения по спутниковым снимкам",
        "description": "На агентство «Узбеккосмос» возложена задача выявления правонарушений в сельском и водном хозяйстве, земельных отношениях, экологии и геологии путём анализа космических снимков.",
        "publication": "24 ноября 2022, 09:17 ",
        "image_link": "https://www.gazeta.uz/media/img/2022/11/NQHScf16692633673640_m.jpg"
    },
    {
        "title": "Французская Alstom построит трамвайные линии в Ташкенте",
        "description": "Французская Alstom построит трамвайные линии в Ташкенте. Стоимость линий протяжённостью 9,1 км оценивается в 167,4 млн евро. Одна из них может пролегать от станции метро «Дустлик» по улице Новый Узбекистан. Соглашение подписано в Париже во время визита президента Узбекистана.",
        "publication": "23 ноября 2022, 17:44 ",
        "image_link": "https://www.gazeta.uz/media/img/2022/11/5dIYFY16692069781884_m.jpg"
    }
]