[
    {
        "title": "Школьница, которую нашли повешенной, последнее время жила без родителей — хокимият",
        "description": "Семиклассница, которую нашли повешенной в ее доме в Ташкенте, некоторое время жила без родителей, с братьями, один из которых взрослый, другой — тоже несовершеннолетний. Мать девочки уехала на заработки, а отец два года назад скончался, сообщил хокимият Мирзо-Улугбекского района.",
        "publication": "Сегодня, 20:01",
        "image_link": "https://www.gazeta.uz/media/img/2020/07/nnrkFY15950944615253_m.jpg"
    },
    {
        "title": "В Ташкенте пройдёт Yandex Ad Conference",
        "description": "Спикеры обсудят, как развивается рынок рекламы в Узбекистане и какие технологии можно использовать сейчас.",
        "publication": "Сегодня, 19:00",
        "image_link": "https://www.gazeta.uz/media/img/2022/12/rIYx4D16698843618253_m.jpg"
    },
    {
        "title": "Видео: Выступление Даулетмурата Тажимуратова в суде",
        "description": "В суде в Бухаре более 2,5 часов выступал основной обвиняемый по делу о событиях в Каракалпакстане 1−2 июля Даулетмурат Тажимуратов. «Газета.uz» вела трансляцию в прямом эфире в YouTube.",
        "publication": "Сегодня, 17:30",
        "image_link": "https://www.gazeta.uz/media/img/2022/11/H9OykN16697152276724_m.jpg"
    },
    {
        "title": "C Humans теперь можно не платить за новый телевизор",
        "description": "Пользователи Humans могут накопить нужную сумму кешбэка, обменять его на понравившуюся модель телевизора и заказать с доставкой на дом.",
        "publication": "Сегодня, 17:00",
        "image_link": "https://www.gazeta.uz/media/img/2022/12/7Tg9mx16698927203201_m.jpg"
    },
    {
        "title": "Шавкат Мирзиёев выразил соболезнования в связи со смертью Цзян Цзэминя",
        "description": "Президент Узбекистана Шавкат Мирзиёев направил соболезнования в связи со смертью бывшего председателя Китая Цзян Цзэминя.",
        "publication": "Сегодня, 16:31",
        "image_link": "https://www.gazeta.uz/media/img/2022/12/PfVgr916698941807569_m.jpg"
    },
    {
        "title": "Ежегодный прирост ВИЧ-инфицированных в Узбекистане стабилизировался",
        "description": "Число людей с ВИЧ в Узбекистане составляет около 45 тысяч, основной их возраст — 30−49 лет. В стране, как и во всем мире, вирус стал чаще передаваться половым путём — в прошлом году такой способ заражения был отмечен у 74,3%. Однако в целом эпидситуация с ВИЧ в Узбекистане стабилизируется.",
        "publication": "Сегодня, 16:10",
        "image_link": "https://www.gazeta.uz/media/img/2019/06/PXzxak15596305084576_m.jpg"
    },
    {
        "title": "Что делать в случае проблем с горячей водой или отоплением",
        "description": "Veolia Energy Tashkent опубликовала инструкцию о том, что делать и куда обращаться, если у жителей столицы наблюдаются проблемы с горячей водой или отоплением.",
        "publication": "Сегодня, 15:07 ",
        "image_link": "https://www.gazeta.uz/media/img/2021/03/dvqglS16146851724655_m.jpg"
    },
    {
        "title": "Air Astana отмечает 20-летие и 12-летие рейсов в Узбекистан",
        "description": "Авиакомпания Air Astana выполняет более 60 международных и внутренних рейсов и предлагает узбекистанцам удобные транзитные рейсы через Алматы или Астану в Стамбул, Сеул, Дубай и другие города.",
        "publication": "Сегодня, 15:00 ",
        "image_link": "https://www.gazeta.uz/media/img/2022/11/McWiA616696382123057_m.jpg"
    },
    {
        "title": "Одно направление тоннеля у Северного вокзала в Ташкенте временно закроют",
        "description": "В связи с ремонтными работами одно направление в тоннеле у Северного вокзала в Ташкенте закроют на полмесяца.",
        "publication": "Сегодня, 13:47 ",
        "image_link": "https://www.gazeta.uz/media/img/2022/12/VTxX9Q16698843141054_m.jpg"
    },
    {
        "title": "За 10 месяцев погибло 25 сотрудников органов внутренних дел — МВД Узбекистана",
        "description": "За январь-октябрь погибло 25 сотрудников МВД Узбекистана, из них 9 — в ДТП, 16 — при исполнении служебных обязанностей. Представитель министерства Хамза Махсумов также сообщил о числе сотрудников, покинувших посты по состоянию здоровья из-за полученных травм.",
        "publication": "Сегодня, 13:08 ",
        "image_link": "https://www.gazeta.uz/media/img/2022/12/PpuOCH16698785103253_m.jpg"
    },
    {
        "title": "EMU поздравил юбилейного клиента",
        "description": "Миллионным клиентом курьерской компании EMU стала жительница Ташкента. Ей вручили подарочный сертификат, купоны на бесплатную доставку и подарок от компании.",
        "publication": "Сегодня, 13:00",
        "image_link": "https://www.gazeta.uz/media/img/2022/11/pqQnQx16698073728740_m.jpg"
    },
    {
        "title": "Ученица 7-го класса найдена повешенной в Ташкенте",
        "description": "12-летняя школьница найдена повешенной на дереве во дворе своего дома в Ташкенте. По данным Генпрокуратуры Узбекистана, девочка могла совершить самоубийство.",
        "publication": "Сегодня, 12:14 ",
        "image_link": "https://www.gazeta.uz/media/img/2022/04/0rfvXq16490087470637_m.jpg"
    },
    {
        "title": "Какая погода ожидается в Узбекистане в декабре",
        "description": "Декабрь 2021 года в Узбекистане был самым тёплым за 20 лет. В этом году декабрь начался со значительного похолодания. Какая погода ожидается в первом месяце зимы — в обзоре Узгидромета.",
        "publication": "Сегодня, 11:17",
        "image_link": "https://www.gazeta.uz/media/img/2019/11/9F5MLO15746817161489_m.jpg"
    },
    {
        "title": "Как поступить в университет в Китае. История студента Хожиакбара Холматова",
        "description": "Хожиакбар Холматов из Ферганы. В 2019 году он уехал учить китайский язык в город Вэйфан, поступил на бюджет в один из лучших вузов страны и посетил 20 городов. В рамках проекта «Заграничный диплом» он рассказал о китайской системе образования и впечатлениях от студенческой жизни в Поднебесной.",
        "publication": "Сегодня, 11:07",
        "image_link": "https://www.gazeta.uz/media/img/2022/11/7VPoDz16697212415350_m.jpg"
    },
    {
        "title": "Суточный прирост случаев ковида в Узбекистане составил 155",
        "description": "В среду в Узбекистане было выявлено 155 случаев коронавируса. Суточный прирост увеличивается уже несколько дней.",
        "publication": "Сегодня, 10:04",
        "image_link": "https://www.gazeta.uz/media/img/2022/02/jfWUPm16439572978287_m.jpg"
    },
    {
        "title": "Mobiuz празднует восьмилетие деятельности",
        "description": "В честь своего дня рождения компания Mobiuz подготовила для абонентов новые акции, тарифные планы и услуги.",
        "publication": "Сегодня, 09:00",
        "image_link": "https://www.gazeta.uz/media/img/2022/11/9lswtv16698106255262_m.jpg"
    },
    {
        "title": "Форум свекровей прошёл в Ташкенте. О чём там говорили",
        "description": "В Ташкенте прошёл форум свекровей, где звучали лекции «Роль современной свекрови в семье», «За моим сыном теперь будут присматривать» и др. Цели форума — повышение роли свекровей в укреплении семьи, недопущение вмешательства в жизнь молодожёнов. Участники предложили объявить 30 ноября Днём свекрови.",
        "publication": "Вчера, 20:47 ",
        "image_link": "https://www.gazeta.uz/media/img/2022/11/GrRKAd16698187489797_m.jpg"
    },
    {
        "title": "Председатель махалли подал заявление на депутата Ташкента за оскорбление",
        "description": "Депутат Ташкентского кенгаша Улугбек Хамидов пытался заверить в махалле «Тикланиш» акт для последующей вырубки деревьев. Председатель махалли Тохир Собиров ему отказал, после чего депутат нецензурно выругался. Аксакал подал заявление в ОВД. «Газета.uz» поговорила с ними обоими.",
        "publication": "Вчера, 18:59 ",
        "image_link": "https://www.gazeta.uz/media/img/2022/11/lTzNLx16698150337259_m.jpg"
    },
    {
        "title": "СГБ пресекла оборот более 30 кг наркотиков в Ферганской области",
        "description": "Сотрудники Службы государственной безопасности изъяли из незаконного оборота более 25 кг гашиша и почти 5 кг опия, ввезённых контрабандным путём из Таджикистана.",
        "publication": "Вчера, 17:39",
        "image_link": "https://www.gazeta.uz/media/img/2022/11/R4Hsrg16698064874711_m.jpg"
    },
    {
        "title": "В ТРЦ Samarqand Darvoza пройдёт большая распродажа",
        "description": "2, 3, 4 декабря в ТРЦ Samarqand Darvoza пройдёт Hot Winter Sale со скидками до 90%.",
        "publication": "Вчера, 17:00",
        "image_link": "https://www.gazeta.uz/media/img/2022/11/xhepZW16696336667147_m.jpg"
    }
]