[
    {
        "title": "Суточный прирост случаев ковида в Узбекистане составил 155",
        "description": "В среду в Узбекистане было выявлено 155 случаев коронавируса. Суточный прирост увеличивается уже несколько дней.",
        "publication": "Сегодня, 10:04",
        "image_link": "https://www.gazeta.uz/media/img/2022/02/jfWUPm16439572978287_m.jpg"
    },
    {
        "title": "Более 140 случаев ковида выявлено за день в Узбекистане",
        "description": "Во вторник в Узбекистане был выявлен 141 случай коронавируса, что на 10 больше, чем за предыдущий день. Самое большое число заболевших, как обычно, приходится на Ташкент — 76 человек.",
        "publication": "Вчера, 10:18 ",
        "image_link": "https://www.gazeta.uz/media/img/2020/08/zdg6Sh15965343066786_m.jpg"
    },
    {
        "title": "Узбекистан получил почти 143 тысячи доз вакцины Pfizer",
        "description": "В Узбекистан доставлены почти 143 тысячи доз вакцины от коронавируса Pfizer. Ещё 3 миллиона доз ожидаются в декабре.",
        "publication": "28 ноября 2022, 13:46",
        "image_link": "https://www.gazeta.uz/media/img/2022/11/lnQ2Zl16696241342376_m.jpg"
    },
    {
        "title": "За сутки выявлено почти 140 случаев ковида",
        "description": "В воскресенье в Узбекистане было официально подтверждено 137 случаев коронавируса. Третий день подряд прирост превышает 120 случаев.",
        "publication": "28 ноября 2022, 10:00",
        "image_link": "https://www.gazeta.uz/media/img/2020/07/49ldZW15951535858207_m.jpg"
    },
    {
        "title": "Прирост случаев ковида превысил 120",
        "description": "В пятницу в Узбекистане официально подтверждено 124 случая коронавируса. Впервые с июня эта цифра превысила отметку в 100 случаев.",
        "publication": "26 ноября 2022, 12:01",
        "image_link": "https://www.gazeta.uz/media/img/2022/10/TORFfW16660929976448_m.jpg"
    },
    {
        "title": "Число суточных заражений коронавирусом в Китае достигло рекорда",
        "description": "В Китае суточное число новых случаев коронавируса составило рекордные с начала пандемии 31,5 тысячи. В Узбекистане также наблюдается рост числа инфицированных, но оснований для принятия сейчас ограничительных мер в СЭС не видят, поскольку ситуация является контролируемой.",
        "publication": "25 ноября 2022, 16:25 ",
        "image_link": "https://www.gazeta.uz/media/img/2020/07/HewBv215943951064326_m.jpg"
    },
    {
        "title": "Суточный прирост случаев ковида приблизился к 100",
        "description": "Во вторник в Узбекистане зарегистрировано 96 случаев коронавируса, из них 57 — в Ташкенте. Это самый высокий показатель с середины июля.",
        "publication": "23 ноября 2022, 10:11 ",
        "image_link": "https://www.gazeta.uz/media/img/2022/02/BlSCrm16439572940716_m.jpg"
    },
    {
        "title": "Число новых случаев ковида резко выросло",
        "description": "В пятницу в Узбекистане зарегистрировано 92 случая коронавируса, из них 71 — в Ташкенте. Днём ранее было выявлено 69 случаев.",
        "publication": "19 ноября 2022, 10:05 ",
        "image_link": "https://www.gazeta.uz/media/img/2022/10/A10yvK16663376519311_m.jpg"
    },
    {
        "title": "Узбекистан и Китай тестируют новую вакцину от коронавируса",
        "description": "Учёные Узбекистана и Китая приступили к клиническим испытаниям вакцины второго поколения против новых штаммов коронавируса. По данным разработчиков, она вызывает «более широкий и сильный иммунный ответ, охватывая распространённые в настоящее время подварианты омикрона».",
        "publication": "8 ноября 2022, 12:28",
        "image_link": "https://www.gazeta.uz/media/img/2022/11/XEUEyL16678849626776_m.jpg"
    },
    {
        "title": "Ещё 583 тысячи доз вакцины Johnson & Johnson получил Узбекистан",
        "description": "В Узбекистан доставлена очередная партия вакцины от коронавируса Johnson & Johnson в объёме 583,2 тысячи доз. До конца года ожидается дополнительная поставка.",
        "publication": "5 ноября 2022, 12:40",
        "image_link": "https://www.gazeta.uz/media/img/2022/10/2flqPG16672214281351_m.jpg"
    },
    {
        "title": "Аллея памяти медиков пополнилась 90 деревьями",
        "description": "В декабре напротив Парка Победы в Ташкенте была заложена Аллея памяти медиков. Тогда горожане посадили 60 деревьев в честь врачей, отдавших жизнь в борьбе с COVID-19. Второй этап этого социального проекта состоялся 29 октября, в рамках которого почтили память ещё 90 медработников.",
        "publication": "1 ноября 2022, 18:48 ",
        "image_link": "https://www.gazeta.uz/media/img/2022/11/WFgrQF16673102941451_m.jpg"
    },
    {
        "title": "Узбекистан впервые получил детскую вакцину от ковида Pfizer",
        "description": "Узбекистан в рамках COVAX впервые получил детскую вакцину Pfizer против COVID-19 в объёме 201,6 тысячи доз. Она безвозмездно предоставлена Евросоюзом и правительством Швеции и предназначена для детей 5−11 лет.",
        "publication": "29 августа 2022, 16:53 ",
        "image_link": "https://www.gazeta.uz/media/img/2022/08/MYgAbJ16617733209813_m.jpg"
    },
    {
        "title": "В Таджикистане вновь введены коронавирусные ограничения",
        "description": "На границе в Таджикистане временно вернули коронавирусные ограничения. По прилёте в страну необходимо предъявить результаты ПЦР-теста или сертификат о вакцинации против COVID-19. При этом новые случаи заболевания не выявлялись с февраля.",
        "publication": "26 августа 2022, 12:15",
        "image_link": "https://www.gazeta.uz/media/img/2020/07/aO6t8615943959300702_m.jpg"
    },
    {
        "title": "Нурмат Атабеков не исключил проникновение подвида «кентавр» штамма «омикрон»",
        "description": "Замглавы СЭС Нурмат Атабеков не исключил, что новый подвид омикрон-штамма коронавируса «кентавр» мог проникнуть в Узбекистан. Он подчеркнул, что заболевание протекает так же, как и при других подвидах «омикрона», и что имеющиеся вакцины защищают от осложнений при всех вариантах ковида.",
        "publication": "17 июля 2022, 15:48 ",
        "image_link": "https://www.gazeta.uz/media/img/2022/05/04s53316532905499578_m.jpg"
    },
    {
        "title": "ВОЗ рекомендует всем странам вернуть масочный режим",
        "description": "Всемирная организация здравоохранения призвала правительства всех стран действовать, чтобы сдержать нарастание заболеваемости коронавирусом. Рекомендуется уже известный набор мер: масочный режим, дистанцирование, частое мытьё рук, избегание людных мест и помещений с плохой вентиляцией.",
        "publication": "13 июля 2022, 22:43",
        "image_link": "https://www.gazeta.uz/media/img/2020/10/UJuwEF16038864551859_m.jpg"
    },
    {
        "title": "За две недели заболеваемость ковидом в мире выросла на 30% — ВОЗ",
        "description": "ВОЗ заявила о значительном росте заболеваемости COVID-19 в мире за последние две недели. В основном распространяются существующие подвиды омикрон-штамма, но выявлены и новые. В организации подчёркивают важность бустерной вакцинации.",
        "publication": "7 июля 2022, 09:40",
        "image_link": "https://www.gazeta.uz/media/img/2020/04/bAPB5o15859340318899_m.jpg"
    },
    {
        "title": "Узбекистан получил ещё 2 миллиона доз вакцины Pfizer",
        "description": "Узбекистан получил от США в рамках механизма COVAX ещё 2 миллиона доз вакцины от коронавируса Pfizer.",
        "publication": "4 июля 2022, 16:13",
        "image_link": "https://www.gazeta.uz/media/img/2022/07/3RXwiz16569329925327_m.jpg"
    },
    {
        "title": "Россия снимает ограничения на пересечение границы",
        "description": "С 15 июля Россия снимает ограничения на пересечение границы, введённые в 2020 году в связи с распространением COVID-19. Требование о предоставлении результатов ПЦР-тестирования сохраняется для всех въезжающих, кроме граждан Беларуси.",
        "publication": "4 июля 2022, 15:49",
        "image_link": "https://www.gazeta.uz/media/img/2020/11/Cb4XaV16064866974946_m.jpg"
    },
    {
        "title": "«Ковид никуда не исчезал». Чем новая волна коронавируса отличается от прошлых",
        "description": "Директор Зангиатинской специализированной многопрофильной больницы инфекционных заболеваний No2 Дониёр Миразимов в интервью «Газете.uz» рассказал, чем текущая волна коронавируса отличается от предыдущих, при каких симптомах необходима госпитализация и имеет ли смысл возвращать масочный режим.",
        "publication": "30 июня 2022, 11:26 ",
        "image_link": "https://www.gazeta.uz/media/img/2022/06/BRhlzL16565691156643_m.jpg"
    },
    {
        "title": "СЭС: Масочный режим пока не вводится, но носить маски рекомендуется",
        "description": "90% заболевших ковидом в последнее время — непривитые люди. В СЭС заявили, что масочный режим пока не вводится, но «для здоровья и безопасности» маски рекомендуются. На совещаниях у президента чиновники снова присутствуют в масках.",
        "publication": "29 июня 2022, 16:32 ",
        "image_link": "https://www.gazeta.uz/media/img/2022/06/rNkhmX16565022913443_m.jpg"
    }
]